Merge pull request #438 from pietbarber/feature/435-mail-server-ansible
Add mail server integration to single-host Ansible deployment
